HW05/load_html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2220000000000013,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.949999999999989,
    "pct3ResTime" : 7.0,
    "throughput" : 10.732147073343494,
    "receivedKBytesPerSec" : 4.149484052029449,
    "sentKBytesPerSec" : 1.3511605475541437
  },
  "GET Order Detail" : {
    "transaction" : "GET Order Detail",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2220000000000013,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.949999999999989,
    "pct3ResTime" : 7.0,
    "throughput" : 10.732147073343494,
    "receivedKBytesPerSec" : 4.149484052029449,
    "sentKBytesPerSec" : 1.3511605475541437
  }
}