HW05/spike_html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 15606,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5334486735870878,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 8.0,
    "throughput" : 115.97800237812127,
    "receivedKBytesPerSec" : 35.439421192219086,
    "sentKBytesPerSec" : 39.41439924568965
  },
  "PUT Cancel Order (SPIKE)" : {
    "transaction" : "PUT Cancel Order (SPIKE)",
    "sampleCount" : 12348,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2333981211532183,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 831.4591609992593,
    "receivedKBytesPerSec" : 254.14718495387515,
    "sentKBytesPerSec" : 282.56619924584203
  },
  "PUT Cancel Order (Recovery)" : {
    "transaction" : "PUT Cancel Order (Recovery)",
    "sampleCount" : 1643,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.169811320754715,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 27.510339400231064,
    "receivedKBytesPerSec" : 8.408922101828441,
    "sentKBytesPerSec" : 9.349216905547276
  },
  "PUT Cancel Order" : {
    "transaction" : "PUT Cancel Order",
    "sampleCount" : 1615,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.180185758513933,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 11.0,
    "throughput" : 27.131457370852583,
    "receivedKBytesPerSec" : 8.268502598698026,
    "sentKBytesPerSec" : 9.220456215875682
  }
}